{
  "id": "CLEANSTART-2025-PB23030",
  "aliases": [
    "CVE-2025-29923",
    "CVE-2025-61727",
    "CVE-2025-61729"
  ],
  "details": "CVE-2025-61729: Within HostnameError.Error(), when constructing an error string, there is no limit to the number of hosts that will be printed out. Furthermore, the error string is constructed by repeated string concatenation, leading to quadratic runtime. Therefore, a certificate provided by a malicious actor can result in excessive resource consumption.\\n\\nCVE-2025-61727: An excluded subdomain constraint in a certificate chain does not restrict the usage of wildcard SANs in the leaf certificate. For example a constraint that excludes the subdomain test.example.com does not prevent a leaf certificate from claiming the SAN *.example.com.\\n\\nCVE-2025-29923: go-redis is the official Redis client library for the Go programming language. Prior to 9.5.5, 9.6.3, and 9.7.3, go-redis potentially responds out of order when `CLIENT SETINFO` times out during connection establishment. This can happen when the client is configured to transmit its identity, there are network connectivity issues, or the client was configured with aggressive timeouts. The problem occurs for multiple use cases. For sticky connections, you receive persistent out-of-order responses for the lifetime of the connection. All commands in the pipeline receive incorrect responses. When used with the default ConnPool once a connection is returned after use with ConnPool#Put the read buffer will be checked and the connection will be marked as bad due to the unread data. This means that at most one out-of-order response before the connection is discarded. This issue is fixed in 9.5.5, 9.6.3, and 9.7.3. You can prevent the vulnerability by setting the flag DisableIndentity to true when constructing the client instance.",
  "summary": "go-redis is the official Redis client library for the Go programming language",
  "affected": [
    {
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "2.6.2-r0"
            }
          ]
        }
      ],
      "package": {
        "name": "harbor-registry-fips",
        "purl": "pkg:cleanstart/harbor-registry-fips",
        "ecosystem": "CLEANSTART"
      },
      "versions": []
    }
  ],
  "modified": "2025-12-10T05:34:05Z",
  "severity": [
    {
      "type": "CVSS_V3",
      "score": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H"
    }
  ],
  "published": "2025-12-17T12:12:25.793304Z",
  "references": [
    {
      "url": "https://osv.dev/vulnerability/CVE-2025-61729",
      "type": "WEB"
    },
    {
      "url": "https://osv.dev/vulnerability/CVE-2025-61727",
      "type": "WEB"
    },
    {
      "url": "https://osv.dev/vulnerability/CVE-2025-29923",
      "type": "WEB"
    },
    {
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2025-61729",
      "type": "WEB"
    },
    {
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2025-61727",
      "type": "WEB"
    },
    {
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2025-29923",
      "type": "WEB"
    },
    {
      "url": "https://pkgs.alpinelinux.org/packages?name=harbor-registry-fips&branch=edge",
      "type": "PACKAGE"
    }
  ],
  "schema_version": "1.7.3"
}